#include <stdio.h>

#include "../inc/print_info.h"

void print_menu(void)
{
    printf("\n"
           "Пункты меню:\n"
           "1 - Добавить в бинарное дерево слова из файла\n"
           "2 - Добавить в бинарное дерево слово, введенное с клавиатуры\n"
           "3 - Вывести бинарное дерево в консоли\n"
           "4 - Вывести бинарное дерево на картинке\n"
           "5 - Вывести все слова в дереве, начинающиеся на указанную букву\n"
           "6 - Удалить из дерева слово, введенное с клавиатуры\n"
           "7 - Удалить из дерева и файла все слова, начинающиеся на указанную букву и сравнить время удаления слов\n"
           "0 - выход из программы\n");
}
