#include "../inc/print_info.h"


void print_menu(void)
{
    printf("\n"
           "Пункты меню:\n"
           "Массив\n"
           "1. Добавить элемент\n"
           "2. Удалить элемент\n"
           "3. Распечатать очередь\n"
           "Список\n"
           "4. Добавить элемент\n"
           "5. Удалить элемент\n"
           "6. Распечатать очередь\n"
           "7. Распечатать распечатать массив освободившихся адрессов\n"
           "Выполнить задание\n"
           "8. Для массива\n"
           "9. Для списка\n"
           "10. Замеры времени и памяти\n"
           "0. Выход из программы\n\n");
}

